muaxiaohei/ThreadX_H750/Hardware/ebf_lcd_rgb_7_5_4.3_20221109/2-STM32系列配套程序/4.3_5_7寸兼容/F429_V2/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2015-xx-xx
  * @brief   LTDC-LCD触摸画板
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火 STM32  F429开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */
  
#include "stm32f4xx.h"
#include "./led/bsp_led.h"
#include "./usart/bsp_debug_usart.h"
#include "./sdram/bsp_sdram.h"
#include "./lcd/bsp_lcd.h"
#include "./touch/gt9xx.h"
#include "./touch/palette.h"
#include "./systick/bsp_SysTick.h"

void Delay(__IO u32 nCount); 

/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
	/* LED 端口初始化 */
	LED_GPIO_Config();	
	
  Debug_USART_Config();    
  printf("\r\n野火STM3F429 触摸画板测试例程\r\n");

//	LED_BLUE;
	/* 初始化触摸屏 */
  GTP_Init_Panel();
    
  printf("\r\n提示：\r\n"
         "如果是4.3寸/5寸的RGB屏幕，使用的触摸芯片可能是GT1151QM。\r\n"
         "如果触摸或显示异常，请确认使用的屏幕触摸芯片型号，"
         "在“bsp_i2c_touch.h”文件修改宏定义 LCD_TOUCH_IC_GT1151QM。\r\n\r\n");
  
		SysTick_Init();
	/*初始化液晶屏*/
  LCD_Init();
	

  LCD_LayerInit();
  LTDC_Cmd(ENABLE);
	
	/*把背景层刷黑色*/
  LCD_SetLayer(LCD_BACKGROUND_LAYER);  
	LCD_Clear(LCD_COLOR_BLACK);
	
  /*初始化后默认使用前景层*/
	LCD_SetLayer(LCD_FOREGROUND_LAYER); 
	/*默认设置不透明	，该函数参数为不透明度，范围 0-0xff ，0为全透明，0xff为不透明*/
  LCD_SetTransparency(0xFF);
	LCD_Clear(LCD_COLOR_BLACK);
	
	/*调用画板函数*/
	Palette_Init();


  Delay(0xfff);
   

  while(1);
   

}



void Delay(__IO uint32_t nCount)	 //简单的延时函数
{
	for(; nCount != 0; nCount--);
}
/*********************************************END OF FILE**********************/

